Importing all necessary modules

In [16]:
try:
    import pandas as pd
    import numpy as np
    # import matplotlib.pyplot as plt   
    # import time
    # import sys
    print("all modules imported succesfully")
except Exception as e:
    print(e)
    exit()

all modules imported succesfully

# Pandas Tutorial Code

### Creating Series

Using List

In [17]:
list1 = [_ for _ in range(11,66,11)]
ser_form_list1 = pd.Series(list1)
ser_form_list1

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [18]:
list2 = [11,22,"priyang",44,1.33]
ser_form_list2 = pd.Series(list2)
ser_form_list2

0         11
1         22
2    priyang
3         44
4       1.33
dtype: object

Using Tuple

In [19]:
tuple1 = (_ for _ in range(11,66,11))
ser_form_tuple1 = pd.Series(tuple1)
ser_form_tuple1

0    11
1    22
2    33
3    44
4    55
dtype: int64

Using Dictionary

In [20]:
dict1 = {i-1:11*i for i in range(1,6)}
ser_form_dict1 = pd.Series(dict1)
ser_form_dict1

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [21]:
dict2 = {1:11,3:22,5:22,7:33,10:44,12:55}
ser_form_dict2 = pd.Series(dict2)
ser_form_dict2

1     11
3     22
5     22
7     33
10    44
12    55
dtype: int64

Using Numpy Array

In [22]:
numpy_arr1 = np.arange(11,66,11)
ser_form_numpy_arr1 = pd.Series(numpy_arr1)
ser_form_numpy_arr1

0    11
1    22
2    33
3    44
4    55
dtype: int32

Using Scalar Value

In [23]:
scalar_value = 11
ser_form_scalar_value = pd.Series(scalar_value,index=[_ for _ in range(6)])
ser_form_scalar_value

0    11
1    11
2    11
3    11
4    11
5    11
dtype: int64

### Series with custom index

In [24]:
ser_form_list1_cus_idx = pd.Series(list1,index=[chr(97+i) for i in range(5)],dtype=float)
ser_form_list1_cus_idx

a    11.0
b    22.0
c    33.0
d    44.0
e    55.0
dtype: float64

### Accessing Values via Slicing

In [25]:
ser_form_list1[0]

11

In [26]:
ser_form_list1[0:2]

0    11
1    22
dtype: int64

### Operation on Pandas Series

In [27]:
op_s1 = pd.Series([i for i in range(1,6)])
op_s2 = pd.Series([10*i for i in range(1,6)])

In [28]:
op_s1+op_s2

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [29]:
op_s1-op_s2

0    -9
1   -18
2   -27
3   -36
4   -45
dtype: int64

In [30]:
op_s1*op_s2

0     10
1     40
2     90
3    160
4    250
dtype: int64

In [31]:
op_s1/op_s2

0    0.1
1    0.1
2    0.1
3    0.1
4    0.1
dtype: float64

In [32]:
(op_s1+op_s2)**2

0     121
1     484
2    1089
3    1936
4    3025
dtype: int64

If 2 Series have unequal number of element then<br/>
remaining elements will give nan on operations

In [33]:
op_s1+op_s2[:op_s2.size-1]

0    11.0
1    22.0
2    33.0
3    44.0
4     NaN
dtype: float64

### Creating DataFrame

Using List

In [34]:
df_from_list1 = pd.DataFrame([_ for _ in range(11,66,11)])
df_from_list1

    0
0  11
1  22
2  33
3  44
4  55

Using Nested List

In [35]:
df_from_list2 = pd.DataFrame([["Priyang",98],["Vedant",89],["Parshav",88]])
df_from_list2

         0   1
0  Priyang  98
1   Vedant  89
2  Parshav  88

Using Dictionary

In [36]:
dict2 = {"Name":["Priyang","Aadhaya","krishna"],"Marks":[98,89,99]}
df_from_dict = pd.DataFrame(dict2)
df_from_dict

      Name  Marks
0  Priyang     98
1  Aadhaya     89
2  krishna     99

Using Numpy Array

In [37]:
arr_for_df =  np.arange(1,10).reshape(3,-1)
df_from_np_array = pd.DataFrame(arr_for_df,
                columns=[chr(i+97) for i in range(arr_for_df.shape[1])], ## cols
                index=[i for i in range(arr_for_df.shape[0])]) ## no of rows
df_from_np_array

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

Using Series

In [38]:
dict3 = {
    'First':pd.Series([chr(97+i) for i in range(4)]),
    'Second':pd.Series([chr(ord('w')+i) for i in range(4)])
}

df_from_series = pd.DataFrame(dict3)
df_from_series

  First Second
0     a      w
1     b      x
2     c      y
3     d      z

### Dataframe with Custom Index

In [48]:
df_cus_idx = pd.DataFrame(dict2,index=["stu"+str(i) for i in range(1,4)])
df_cus_idx

         Name  Marks
stu1  Priyang     98
stu2  Aadhaya     89
stu3  krishna     99

In [63]:
list3 = [["Priyang",98],["Vedant",89],["Parshav",88]]

df_cus_via_nes_lst = pd.DataFrame(list3,
                    columns=["Name","Marks"],
                    index=[11*(i+1) for i in range(len(list3))]) 
df_cus_via_nes_lst

       Name  Marks
11  Priyang     98
22   Vedant     89
33  Parshav     88

QUESTION SET1

In [65]:
list4 = [["Ahmeddabad",40.1],["Anand",35.2],["Baroda",38.5]]
pd.DataFrame(list4,columns=["City","Temp"],index=[1,2,3])

         City  Temp
1  Ahmeddabad  40.1
2       Anand  35.2
3      Baroda  38.5